Revit 2027 API
BuiltInFailures.AutoRouteFailures.ElementHasOpenConnection Property
 This element has an open connection. This may not be an error, but all open connections should be sealed with an end cap.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementHasOpenConnection { get; }
Public Shared ReadOnly Property ElementHasOpenConnection As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementHasOpenConnection {
	FailureDefinitionId^ get ();
}
static member ElementHasOpenConnection : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace